[
    {
        "q":"What is a target? ",
        "a":"A target is referred to as the unique domain address of a website, defined by its name or IP, protocol (e.g., HTTP\/HTTPS), and port (e.g., 80\/8080). For example, `https:\/\/app.domain.com `and `https:\/\/docs.domain.com` are considered distinct domains because they use different subdomains (app vs. docs), even though they share the same base domain (domain.com). This distinction allows ZeroThreat to treat them as separate entities for scanning purposes. \n\nFor more Information refers Targets "
    },
    {
        "q":"How do I add a target in ZeroThreat? ",
        "a":"Navigate to the Targets page, click 'Add Target,' input the web app URL (e.g.,` https:\/\/app.example.com`), select a scanning server, assign it to an organization, and save. This sets up your scan starting point. "
    },
    {
        "q":"What exactly counts as a host or target in ZeroThreat (IP, domain, subdomain)? ",
        "a":"In ZeroThreat, a host (target) refers to any unique IP address, domain, or subdomain that is scanned for vulnerabilities. Each distinct entry is considered a separate host. "
    },
    {
        "q":"If I scan subdomains, does each subdomain count as a separate target? ",
        "a":"Yes, each subdomain is treated as a separate target and will count individually for scanning and reporting purposes. "
    },
    {
        "q":"Are there any discounts available for multiple targets in the Target-based Unlimited Scan plan? ",
        "a":"Yes, there are discounts available of 20% when you add multiple targets. These discounts are tailored based on the number of targets you add. Each additional credit costs just $75 per month, giving you the flexibility to scale as needed. For more details, please refer to the pricing sheet or contact our sales team for a customized quote. "
    },
    {
        "q":"How do I verify a target? ",
        "a":"Go to Targets, click 'Verify Now,' and choose either uploading a provided HTML file to your site’s root or adding a DNS TXT record via your provider. After setup, click 'Verify' to confirm. Check Docs for a detailed step-by-step guide. "
    },
    {
        "q":"What is target configuration? ",
        "a":"Target configuration customizes scan settings like server location, technology stack, authentication templates, allowed hosts, and ignored URIs. It ensures scans align with your app’s specifics for more accurate and relevant results. "
    },
    {
        "q":"What is an additional target? ",
        "a":"An additional target refers to a new domain, subdomain, or IP address added to your existing account for scanning. It allows you to extend your security coverage to other assets. "
    },
    {
        "q":"Why configure the technology stack? ",
        "a":"Specifying the app’s tech stack (e.g., PHP, ASP.NET) ensures ZeroThreat provides accurate analysis and tailored remediation. This customization enhances scan effectiveness, executive summary and makes the remediation for developers more convenient. "
    },
    {
        "q":"How do I add custom headers? ",
        "a":"Go to Targets, select your target, navigate to Request Headers in configuration, choose a request target, enter a key (e.g., 'access_token') and value, then save. This applies to all scan requests for that target. Check Docs for detailed step-by-step guide. "
    },
    {
        "q":"How to allow Hosts? ",
        "a":"By default, a target includes all URLs within its domain, such as `https:\/\/example.com\/blogs` from `https:\/\/example.com\/dashboard`. To add external domains, like `payments.thirdparty.com`, go to the Targets section, locate the target, and click the gear icon to open the configuration drawer. Enter the external hosts in the Allowed Hosts section. This ensures ZeroThreat scans all related resources for a complete security assessment. "
    },
    {
        "q":"How often can I change targets under a Professional plan? ",
        "a":"With the Professional plan, you get a 30-day cooling period that allows you to flexibly change your target or host as needed. "
    },
    {
        "q":"Does scanning the same host multiple times use additional credits in Pay Per Credit plan? ",
        "a":"No, scanning the same host multiple times does not consume additional credits. However, you can perform unlimited rescans for up to two weeks, provided there are no code modifications during that period. "
    },
    {
        "q":"Can I scan unlimited targets with the Pay Per Scan plan? ",
        "a":"Yes, with the Pay Per Scan plan, you can scan unlimited targets. The plan is credit-based, so each scan for a new target consumes a credit, but there are no restrictions on the number of unique hosts you can scan using your available credits. You can also buy new credits with a great discount for additional target. "
    }
]