[
    {
        "q":"Why do I need to perform an authenticated scan? ",
        "a":"Authenticated scans uncover vulnerabilities in protected areas like user dashboards or admin panels, which traditional scanners can’t access. They ensure that all parts of your application are tested, protect sensitive user data, and provide a more comprehensive security assessment. "
    },
    {
        "q":"Why do I need to use the ZeroThreat AI Chrome extension? ",
        "a":"The ZeroThreat AI Chrome Recorder Extension enables authenticated scans by capturing login sequences, including complex steps like MFA, SSO, and CAPTCHAs, to access protected areas such as admin dashboards. It overcomes traditional scanner limitations by navigating intricate workflows and ensuring thorough testing of restricted sections. "
    },
    {
        "q":"How to perform target authentication for login forms using login sequence recording? ",
        "a":"Install the ZeroThreat Chrome Recorder, select your target, and record your login steps (e.g., entering credentials, navigating few authenticated areas and logout). Lastly confirm the recording and start the scan.",
        "link":"For more Information refer [**Scan With Login Sequence**](/docs/getting-started/authenticated-scan/scan-with-login-sequence 'mentions')"
    },
    {
        "q":"Can I reuse a login sequence? ",
        "a":"Yes, login sequences recorded with the Chrome Recorder are saved as templates in Target Configuration. You can reuse them for future scans on the same target, saving time. "
    },
    {
        "q":"Can I scan specific parts of a target? ",
        "a":"Yes, you can use a navigation sequence-only scan to focus only on areas navigated during recording, like a dashboard or search functionality. You can also refine a target’s scope by ignoring unwanted URLs in Target Configuration, such as /login or /test, to exclude them from the scan. This allows ZeroThreat to assess just the intended parts of your application."
    },
    {
        "q":"Can ZeroThreat scan MFA-protected apps? ",
        "a":"Yes, it supports Multi-Factor Authentication scans. Using the ZeroThreat Chrome Recorder extension, it can even scan MFA apps including OTPs, CAPTCHAs, SSO, or others.",
        "link":"For more Information refer [**Scan MFA App**](/docs/getting-started/authenticated-scan/scan-mfa-app 'mentions')"
    },
    {
        "q":"What if the ZeroThreat extension doesn’t open with the target in a new tab during recording? ",
        "a":"When recording a login sequence, the ZeroThreat extension should open with the target page in a new tab, but if it doesn’t, you can open it manually. Launch the target in a new tab, click the extension icon in Chrome’s toolbar, and select ZeroThreat AI Recorder. Copy the Steps Token and Target Code from the scanning portal, paste them into the extension, and click Open Step Recorder to continue. See the docs for a detailed guide. "
    },
    {
        "q":"What are the important things to keep in mind before starting an authenticated test? ",
        "a":"Before starting an authenticated test, ensure you begin recording from a logged-out, fresh state of the target application to maintain consistency. Avoid unnecessary actions during recording to keep the test clean and accurate. Do not use autofill passwords or use shortcuts to ensure the authentication process is properly captured. Finally, configure the target application according to your requirements in the target configuration settings for a precise scan. "
    }
]