[
  {
    "q": "How can I use the Scans section in ZeroThreat?",
    "a": "The Scans section allows you to track active scans, check completed ones, and open detailed reports. You can also see scans shared by others, making it easier to collaborate without repeating scans yourself."
  },
  {
    "q": "How do I delete a scan report?",
    "a": "In the Scans section, find your report, click the three dots icon, and select 'Delete' from the options. Note that deletion is permanent, so ensure you no longer need the report before confirming."
  },
  {
    "q": "What is the data storage location?",
    "a": "It’s the storage location where the scan data is stored. Choosing the right location ensures compliance with laws like GDPR, keeping data secure and within required geographic boundaries. "
  },
  {
    "q": "Why add custom headers to scans?",
    "a": "Custom headers (e.g., authorization tokens or API keys) is an optional setting which can help the scanner interact correctly with your app’s back-end. They also help differentiate scan traffic from real users in logs by adding a custom header (e.g., 'X-Scanner-User: ZeroThreat') for better monitoring."
  },
  {
    "q": "How does ZeroThreat scan resources outside a target’s domain?",
    "a": "Authenticated scans uncover vulnerabilities in protected areas like user dashboards or admin panels, which traditional scanners can’t access. They ensure that all parts of your application are tested, protect sensitive user data, and provide a more comprehensive security assessment."
  },
  {
    "q": "What is a scheduled scan in ZeroThreat?",
    "a": "A scheduled scan in ZeroThreat automates your scanning process by running scans at set times—daily, weekly, or monthly—without manual triggers. It’s ideal for regular security checks, early vulnerability detection, and compliance needs. For example, schedule a scan for Monday at 2:00 AM after Sunday updates to catch issues early."
  },
  {
    "q": "How do I set up a scheduled scan in ZeroThreat?",
    "a": "Go to the Schedule Scan page via the top navigation bar, click Add Schedule Scan, and pick a verified target. Set the timezone, day, and time (e.g., 02:30 AM), then choose a repeat cycle—one-time, daily, weekly, or monthly. Add an authentication template if needed, then click Schedule Scan to confirm."
  },
  {
    "q": "Can I schedule a scan with authentication in ZeroThreat?",
    "a": "Yes, you can add authentication to a scheduled scan by selecting a saved Authenticated Scan Template during setup. These templates, managed in Target Configuration, ensure scans access protected areas. Only existing templates are available for selection."
  }
]