[
    {
        "q": "What are organizations in ZeroThreat?",
        "a": "Organizations in ZeroThreat group users, targets for simpler management. You can set up multiple organizations, each working separately, and assign roles like Reader, Contributor and more to control access. This limits users to specific tasks or resources, keeping everything organized and secure. When a user signup the application asks for the organization name, that’s your default organization, more users can create through the settings page."
    },
    {
        "q": "Why is target owner verification important?",
        "a": "Target owner verification ensures you have permission to scan a target, preventing unauthorized testing. It confirms ownership, and avoids misuse or legal issues. This process safeguards the target owner’s rights and ensures responsible use of ZeroThreat’s scanning capabilities."
    },
    {
        "q": "How do I create an organization?",
        "a": "In Organization Settings, click 'Add Organization,' enter a unique name (e.g., 'ZeroThreat-Security-Team'), select a data storage location, and save. This sets up a hub for your team’s security efforts. Check Docs for detailed step-by-step guide."
    },
    {
        "q": "What user roles exist in ZeroThreat?",
        "a": "Owner has full control, including billing; Administrator manages most features except subscriptions; Contributor runs scans and creates profiles; Reader has view-only access to reports and configs."
    },
    {
        "q": "How do I add a user to an organization?",
        "a": "Go to Organization Settings, click 'Add User,' enter the user’s full name, email, and role (e.g., 'Alice Braun' as Contributor), then save. An invite is sent to their email notifying access to the organization."
    },
    {
        "q": "How to remove a user from an organization?",
        "a": "Head to Organization Settings, pick the organization, and check the member list. Locate the user you want to remove, click the three dots beside their name, click Delete, and confirm the action. If you don’t see the Delete option, your user role doesn’t have the necessary permissions to make changes."
    }
]
