[
    {
        "q": "Why perform an authenticated scan?",
        "a": "Authenticated scans uncover vulnerabilities in protected areas like user dashboards or admin panels, which traditional scanners can’t access. They ensure that all parts of your application are tested, protect sensitive user data, and provide a more comprehensive security assessment."
    },
    {
        "q": "Why use the ZeroThreat AI Chrome Extension?",
        "a": "The ZeroThreat AI Chrome Recorder Extension enables authenticated scans by capturing login sequences, including complex steps like MFA, SSO, and CAPTCHAs, to access protected areas such as admin dashboards. It overcomes traditional scanner limitations by navigating intricate workflows and ensuring thorough testing of restricted sections."
    },
    {
        "q": "How do I scan with a login sequence?",
        "a": "Install the ZeroThreat Chrome Recorder, select your target, and record your login steps (e.g., entering credentials and navigating authenticated areas). Tag key HTTP requests (login, authenticated, logout), save the sequence, and start the scan. Details at Scan with Login Sequence."
    },
    {
        "q": "Can I reuse a login sequence?",
        "a": "Yes, login sequences recorded with the Chrome Recorder are saved as templates in Target Configuration. You can reuse them for future scans on the same target, saving time."
    },
    {
        "q": "Can I scan specific parts of a target?",
        "a": "Yes, you can use a navigation sequence-only scan to focus only on areas navigated during recording, like a dashboard or search functionality. You can also refine a target’s scope by ignoring unwanted URLs in Target Configuration, such as /login or /test, to exclude them from the scan. This allows ZeroThreat to assess just the intended parts of your application."
    },
    {
        "q": "Can ZeroThreat scan MFA-protected apps?",
        "a": "Yes, it supports Multi-Factor Authentication scans. Using the ZeroThreat Chrome Recorder extension, it can even scan MFA apps including OTPs, CAPTCHAs, SSO, or others. Check Scan MFA App for a step-by-step guide."
    },
    {
      "q": "What if the ZeroThreat extension doesn’t open with the target in a new tab during recording?",
      "a": "When recording a login sequence, the ZeroThreat extension should open with the target page in a new tab, but if it doesn’t, you can open it manually. Launch the target in a new tab, click the extension icon in Chrome’s toolbar, and select ZeroThreat AI Recorder. Copy the Steps Token and Target Code from the scanning portal, paste them into the extension, and click Open Step Recorder to continue. See the docs for a detailed guide."
    }
]